In [1]:
%load_ext autoreload
%autoreload 2
import pandas as pd
import seaborn as sns
import feature_generate
import numpy as np

In [76]:
data_train = pd.read_pickle("data_train.pkl")
data_test = pd.read_pickle("data_test.pkl")

In [77]:
data_test.head()

   item_id  shop_id  date_block_num   item_price  item_category_id
0     5037        5              34   749.500000                19
1     5037        4              34   749.333333                19
2     5037        6              34  1499.000000                19
3     5037        3              34  1365.666667                19
4     5037        2              34   749.500000                19

In [78]:
data_train.head()

,item_id,shop_id,date_block_num,item_price,item_cnt_day,item_category_id
0,0,54,20,58.0,1.0,40
1,1,55,15,4490.0,2.0,76
2,1,55,18,4490.0,1.0,76
3,1,55,19,4490.0,1.0,76
4,1,55,20,4490.0,1.0,76

# Predict the missing price in the test data

In [3]:
data_test = pd.read_pickle("data_test.pkl")

In [4]:
data_test.isna().sum()

item_id                 0
shop_id                 0
date_block_num          0
item_price          15246
item_category_id        0
dtype: int64

In [5]:
data_test.shape

(214200, 5)

In [6]:
data_test.head()

   item_id  shop_id  date_block_num   item_price  item_category_id
0     5037        5              34   749.500000                19
1     5037        4              34   749.333333                19
2     5037        6              34  1499.000000                19
3     5037        3              34  1365.666667                19
4     5037        2              34   749.500000                19